{
  "home": "Home",
  "courses": "Courses",
  "tests": "Quizzes",
  "rating": "Rating",
  "aboutus": "About Us",
  "login": "Sign in",
  "register": "Sign up",
  "logout": "Sign out",
  "homePageTypographyText1": "Get a new mindset: expand your knowledge in modern fields through our website. but first...",
  "homePageIQTestButton": "Take an IQ test",
  "suggestedCoursesCarouselHeader": "Now that you have passed the general test, we can offer you courses",
  "mathematics": "Mathematics",
  "programming": "Programming",
  "english": "English",
  "graphicDesign": "Graphic-design",
  "UX/UI": "UX/UI design",
  "howToUseHeader": "How to use",
  "stepOneOfHowToUse": "Step 1: Choose a course and start studying the material.",
  "stepTwoOfHowToUse": "Step 2. Take quizes to test your knowledge",
  "stepThreeOfHowToUse": "Step 3: Look at the rating and discuss the results.",
  "ourPlatformHeader": "Our platform",
  "popularCoursesHeader": "The most popular courses",
  "aboutCoursesSectionHeader": "About our courses",
  "aboutCoursesSectionText1": "Our courses are prepared by the best specialists",
  "aboutCoursesSectionText2": "The information is from reliable sources.",
  "aboutCoursesSectionText3": "Selected courses are based on the needs of the audience.",
  "aboutCoursesSectionText4": "Completion of the test following each course is mandatory.",
  "headerOfNonRegisterdUserRatingSection": " Sign up! get the appropriate rating",
  "infoForNotRegisteredUserOfRatingSection": "    Dear user, by registering on our website, you will have the opportunity to earn points for courses taken and tests passed. On this page you will see the points you have earned.",
  "aboutUsTypographyText1": "Welcome to our educational website. We are ready to provide high quality educational content for learners of all ages. Our mission is to make learning fun, engaging and accessible for everyone.",
  "aboutUsTypographyText2": "Our team of specialists works to develop educational materials, that cover a wide range of subjects, whether you are a student, a teacher or just a self-taught person",
  "aboutUsTypographyText3": "Thank you for choosing us as your training partner. We will gladly accompany you during your educational journey.",
  "aboutUsTypographyTestsSection": "Take interactive tests of your knowledge in various subjects to evaluate logic.",
  "aboutUsTypographyCoursesSection": "Join our interactive lessons. Communicate in real time with teachers and  students, making learning engaging and  nice",
  "aboutUsTypographyRatingSection": "The rating section allows students to accurately assess their current knowledge and skills. By taking tests and receiving instant feedback, students gain valuable insights into their strengths and weaknesses.",
  "contactUsSection": "If you have any questions, comments or suggestions, please  contact us: You can contact us at:",
  "contactUs": "Contact us",
  "footerFormHeader": "Enter your email address and get started",
  "footerSocialMediaLinksHeader": "Follow us",
  "placeholderForEmail": "You email address",
  "emailValidationText": "Please enter valid email address"
}
