import React from 'react';

const class1Div1Math = () => {
  return (
    <div>
      <h2> Դաս 1. Բնական թվեր և դրանց գրառումը</h2>
      <p>
        Մենք բոլորս կարողանում ենք հաշվել առարկաների քանակը: Հաշվելիս մենք
        թվերին քայլ առ քայլ մեկ ենք գումարում՝ արդյունքում ստանում ենք՝
        1,2,3,4,5,6,7,8,9,10,11,12,... թվերից որևէ մեկը:Հաշվելիս առաջացած
        1,2,3,4,5,6,7,8,9,10,11,12... թվերը կոչվում են բնական թվեր, (0-ն բնական
        թիվ չէ):Ցանկացած երկու բնական թվեր կարելի է համեմատել, այսինքն՝ պարզել,
        թե որ թիվն է մեծ:Թվերի համեմատման ժամանակ օգտագործվում են հատուկ
        նշաններ՝ համեմատման նշաններ: «Մեծ» բառը փոխարինվում է{'>'}նշանով, իսկ
        «փոքր» բառը՝{'<'} նշանով: Թվերի համեմատման նշան է նաև քեզ ծանոթ
        հավասարության՝ =, նշանը:Երկու բնական թվերից մեծ է այն թիվը, որը հաշվելիս
        ավելի ուշ է հանդիպում: Եթե թվերը մեծ չեն, մենք ուղղակի հիշում ենք նրանց
        հաջորդականությունը:Օրինակ Ակնհայտ է, որ ութը մեծ է երեքից՝ 8 {'>'} 3,
        կամ որ 73 {'<'} 120 Մեծ թվերի համար օգտագործվում է հետևյալ կանոնը. 1)
        Եթե երկու բնական թվերի գրառումներում տարբեր քանակներով կարգեր
        (թվանշաններ) կան, ապա ավելի մեծ է այն թիվը, որի կարգերի քանակն ավելի մեծ
        է:2) Եթե թվերի թվանշանների քանակները նույնն են, ապա ավելի մեծ է այն
        թիվը, որի ամենամեծ կարգում գրված թիվն ավելի մեծ է:Եթե այդ կարգի թվերը
        հավասար են, ապա համեմատվում են հաջորդ կարգերը և այդպես շարունակ՝ մինչև
        միավորի կարգը:Օրինակա. Համեմատենք 75428 և 937 թվերը:Առաջին թվի գրառման
        մեջ կա 5 կարգ, իսկ երկրորդի գրառման մեջ՝ 3 կարգ: Ըստ կանոնի, առաջին թիվը
        մեծ է, քանի որ նրա կարգերն ավելի շատ են:բ. Համեմատենք 428 և 528
        թվերը:Երկու թվերն էլ ունեն երեքական կարգ, ուրեմն՝ պետք է համեմատել
        ամենամեծ կարգի թվերը: Քանի որ 4-ը փոքր է 5-ից, ապա առաջին թիվը փոքր է
        երկրորդ թվից: գ. Համեմատենք 9563 և 9566 թվերը:Երկու թվերն էլ ունեն
        չորսական կարգ, ուրեմն՝ պետք է համեմատել ամենամեծ կարգի թվերը: Տեսնում
        ենք, որ երկու թվերում էլ դա 9-ն է: Համընկնում են նաև հաջորդ երկու
        կարգերի թվերը: Քանի որ վերջին կարգում առաջին թվում 3 է, իսկ երկրորդում
        6, ապա երկրորդ թիվն ավելի մեծ է: Մենք բոլորս կարողանում ենք հաշվել
        առարկաների քանակը: Հաշվելիս մենք թվերին քայլ առ քայլ մեկ ենք գումարում՝
        արդյունքում ստանում ենք՝ 1,2,3,4,5,6,7,8,9,10,11,12,... թվերից որևէ
        մեկը:Հաշվելիս առաջացած 1,2,3,4,5,6,7,8,9,10,11,12... թվերը կոչվում են
        բնական թվեր, (0-ն բնական թիվ չէ):Ցանկացած երկու բնական թվեր կարելի է
        համեմատել, այսինքն՝ պարզել, թե որ թիվն է մեծ:Թվերի համեմատման ժամանակ
        օգտագործվում են հատուկ նշաններ՝ համեմատման նշաններ: «Մեծ» բառը
        փոխարինվում է{'>'}նշանով, իսկ «փոքր» բառը՝{'<'} նշանով: Թվերի համեմատման
        նշան է նաև քեզ ծանոթ հավասարության՝ =, նշանը:Երկու բնական թվերից մեծ է
        այն թիվը, որը հաշվելիս ավելի ուշ է հանդիպում: Եթե թվերը մեծ չեն, մենք
        ուղղակի հիշում ենք նրանց հաջորդականությունը:Օրինակ Ակնհայտ է, որ ութը
        մեծ է երեքից՝ 8 {'>'} 3, կամ որ 73 {'<'} 120 Մեծ թվերի համար
        օգտագործվում է հետևյալ կանոնը. 1) Եթե երկու բնական թվերի գրառումներում
        տարբեր քանակներով կարգեր (թվանշաններ) կան, ապա ավելի մեծ է այն թիվը, որի
        կարգերի քանակն ավելի մեծ է:2) Եթե թվերի թվանշանների քանակները նույնն են,
        ապա ավելի մեծ է այն թիվը, որի ամենամեծ կարգում գրված թիվն ավելի մեծ
        է:Եթե այդ կարգի թվերը հավասար են, ապա համեմատվում են հաջորդ կարգերը և
        այդպես շարունակ՝ մինչև միավորի կարգը:Օրինակա. Համեմատենք 75428 և 937
        թվերը:Առաջին թվի գրառման մեջ կա 5 կարգ, իսկ երկրորդի գրառման մեջ՝ 3
        կարգ: Ըստ կանոնի, առաջին թիվը մեծ է, քանի որ նրա կարգերն ավելի շատ են:բ.
        Համեմատենք 428 և 528 թվերը:Երկու թվերն էլ ունեն երեքական կարգ, ուրեմն՝
        պետք է համեմատել ամենամեծ կարգի թվերը: Քանի որ 4-ը փոքր է 5-ից, ապա
        առաջին թիվը փոքր է երկրորդ թվից: գ. Համեմատենք 9563 և 9566 թվերը:Երկու
        թվերն էլ ունեն չորսական կարգ, ուրեմն՝ պետք է համեմատել ամենամեծ կարգի
        թվերը: Տեսնում ենք, որ երկու թվերում էլ դա 9-ն է: Համընկնում են նաև
        հաջորդ երկու կարգերի թվերը: Քանի որ վերջին կարգում առաջին թվում 3 է, իսկ
        երկրորդում 6, ապա երկրորդ թիվն ավելի մեծ է: Մենք բոլորս կարողանում ենք
        հաշվել առարկաների քանակը: Հաշվելիս մենք թվերին քայլ առ քայլ մեկ ենք
        գումարում՝ արդյունքում ստանում ենք՝ 1,2,3,4,5,6,7,8,9,10,11,12,...
        թվերից որևէ մեկը:Հաշվելիս առաջացած 1,2,3,4,5,6,7,8,9,10,11,12... թվերը
        կոչվում են բնական թվեր, (0-ն բնական թիվ չէ):Ցանկացած երկու բնական թվեր
        կարելի է համեմատել, այսինքն՝ պարզել, թե որ թիվն է մեծ:Թվերի համեմատման
        ժամանակ օգտագործվում են հատուկ նշաններ՝ համեմատման նշաններ: «Մեծ» բառը
        փոխարինվում է{'>'}նշանով, իսկ «փոքր» բառը՝{'<'} նշանով: Թվերի համեմատման
        նշան է նաև քեզ ծանոթ հավասարության՝ =, նշանը:Երկու բնական թվերից մեծ է
        այն թիվը, որը հաշվելիս ավելի ուշ է հանդիպում: Եթե թվերը մեծ չեն, մենք
        ուղղակի հիշում ենք նրանց հաջորդականությունը:Օրինակ Ակնհայտ է, որ ութը
        մեծ է երեքից՝ 8 {'>'} 3, կամ որ 73 {'<'} 120 Մեծ թվերի համար
        օգտագործվում է հետևյալ կանոնը. 1) Եթե երկու բնական թվերի գրառումներում
        տարբեր քանակներով կարգեր (թվանշաններ) կան, ապա ավելի մեծ է այն թիվը, որի
        կարգերի քանակն ավելի մեծ է:2) Եթե թվերի թվանշանների քանակները նույնն են,
        ապա ավելի մեծ է այն թիվը, որի ամենամեծ կարգում գրված թիվն ավելի մեծ
        է:Եթե այդ կարգի թվերը հավասար են, ապա համեմատվում են հաջորդ կարգերը և
        այդպես շարունակ՝ մինչև միավորի կարգը:Օրինակա. Համեմատենք 75428 և 937
        թվերը:Առաջին թվի գրառման մեջ կա 5 կարգ, իսկ երկրորդի գրառման մեջ՝ 3
        կարգ: Ըստ կանոնի, առաջին թիվը մեծ է, քանի որ նրա կարգերն ավելի շատ են:բ.
        Համեմատենք 428 և 528 թվերը:Երկու թվերն էլ ունեն երեքական կարգ, ուրեմն՝
        պետք է համեմատել ամենամեծ կարգի թվերը: Քանի որ 4-ը փոքր է 5-ից, ապա
        առաջին թիվը փոքր է երկրորդ թվից: գ. Համեմատենք 9563 և 9566 թվերը:Երկու
        թվերն էլ ունեն չորսական կարգ, ուրեմն՝ պետք է համեմատել ամենամեծ կարգի
        թվերը: Տեսնում ենք, որ երկու թվերում էլ դա 9-ն է: Համընկնում են նաև
        հաջորդ երկու կարգերի թվերը: Քանի որ վերջին կարգում առաջին թվում 3 է, իսկ
        երկրորդում 6, ապա երկրորդ թիվն ավելի մեծ է: Մենք բոլորս կարողանում ենք
        հաշվել առարկաների քանակը: Հաշվելիս մենք թվերին քայլ առ քայլ մեկ ենք
        գումարում՝ արդյունքում ստանում ենք՝ 1,2,3,4,5,6,7,8,9,10,11,12,...
        թվերից որևէ մեկը:Հաշվելիս առաջացած 1,2,3,4,5,6,7,8,9,10,11,12... թվերը
        կոչվում են բնական թվեր, (0-ն բնական թիվ չէ):Ցանկացած երկու բնական թվեր
        կարելի է համեմատել, այսինքն՝ պարզել, թե որ թիվն է մեծ:Թվերի համեմատման
        ժամանակ օգտագործվում են հատուկ նշաններ՝ համեմատման նշաններ: «Մեծ» բառը
        փոխարինվում է{'>'}նշանով, իսկ «փոքր» բառը՝{'<'} նշանով: Թվերի համեմատման
        նշան է նաև քեզ ծանոթ հավասարության՝ =, նշանը:Երկու բնական թվերից մեծ է
        այն թիվը, որը հաշվելիս ավելի ուշ է հանդիպում: Եթե թվերը մեծ չեն, մենք
        ուղղակի հիշում ենք նրանց հաջորդականությունը:Օրինակ Ակնհայտ է, որ ութը
        մեծ է երեքից՝ 8 {'>'} 3, կամ որ 73 {'<'} 120 Մեծ թվերի համար
        օգտագործվում է հետևյալ կանոնը. 1) Եթե երկու բնական թվերի գրառումներում
        տարբեր քանակներով կարգեր (թվանշաններ) կան, ապա ավելի մեծ է այն թիվը, որի
        կարգերի քանակն ավելի մեծ է:2) Եթե թվերի թվանշանների քանակները նույնն են,
        ապա ավելի մեծ է այն թիվը, որի ամենամեծ կարգում գրված թիվն ավելի մեծ
        է:Եթե այդ կարգի թվերը հավասար են, ապա համեմատվում են հաջորդ կարգերը և
        այդպես շարունակ՝ մինչև միավորի կարգը:Օրինակա. Համեմատենք 75428 և 937
        թվերը:Առաջին թվի գրառման մեջ կա 5 կարգ, իսկ երկրորդի գրառման մեջ՝ 3
        կարգ: Ըստ կանոնի, առաջին թիվը մեծ է, քանի որ նրա կարգերն ավելի շատ են:բ.
        Համեմատենք 428 և 528 թվերը:Երկու թվերն էլ ունեն երեքական կարգ, ուրեմն՝
        պետք է համեմատել ամենամեծ կարգի թվերը: Քանի որ 4-ը փոքր է 5-ից, ապա
        առաջին թիվը փոքր է երկրորդ թվից: գ. Համեմատենք 9563 և 9566 թվերը:Երկու
        թվերն էլ ունեն չորսական կարգ, ուրեմն՝ պետք է համեմատել ամենամեծ կարգի
        թվերը: Տեսնում ենք, որ երկու թվերում էլ դա 9-ն է: Համընկնում են նաև
        հաջորդ երկու կարգերի թվերը: Քանի որ վերջին կարգում առաջին թվում 3 է, իսկ
        երկրորդում 6, ապա երկրորդ թիվն ավելի մեծ է: Մենք բոլորս կարողանում ենք
        հաշվել առարկաների քանակը: Հաշվելիս մենք թվերին քայլ առ քայլ մեկ ենք
        գումարում՝ արդյունքում ստանում ենք՝ 1,2,3,4,5,6,7,8,9,10,11,12,...
        թվերից որևէ մեկը:Հաշվելիս առաջացած 1,2,3,4,5,6,7,8,9,10,11,12... թվերը
        կոչվում են բնական թվեր, (0-ն բնական թիվ չէ):Ցանկացած երկու բնական թվեր
        կարելի է համեմատել, այսինքն՝ պարզել, թե որ թիվն է մեծ:Թվերի համեմատման
        ժամանակ օգտագործվում են հատուկ նշաններ՝ համեմատման նշաններ: «Մեծ» բառը
        փոխարինվում է{'>'}նշանով, իսկ «փոքր» բառը՝{'<'} նշանով: Թվերի համեմատման
        նշան է նաև քեզ ծանոթ հավասարության՝ =, նշանը:Երկու բնական թվերից մեծ է
        այն թիվը, որը հաշվելիս ավելի ուշ է հանդիպում: Եթե թվերը մեծ չեն, մենք
        ուղղակի հիշում ենք նրանց հաջորդականությունը:Օրինակ Ակնհայտ է, որ ութը
        մեծ է երեքից՝ 8 {'>'} 3, կամ որ 73 {'<'} 120 Մեծ թվերի համար
        օգտագործվում է հետևյալ կանոնը. 1) Եթե երկու բնական թվերի գրառումներում
        տարբեր քանակներով կարգեր (թվանշաններ) կան, ապա ավելի մեծ է այն թիվը, որի
        կարգերի քանակն ավելի մեծ է:2) Եթե թվերի թվանշանների քանակները նույնն են,
        ապա ավելի մեծ է այն թիվը, որի ամենամեծ կարգում գրված թիվն ավելի մեծ
        է:Եթե այդ կարգի թվերը հավասար են, ապա համեմատվում են հաջորդ կարգերը և
        այդպես շարունակ՝ մինչև միավորի կարգը:Օրինակա. Համեմատենք 75428 և 937
        թվերը:Առաջին թվի գրառման մեջ կա 5 կարգ, իսկ երկրորդի գրառման մեջ՝ 3
        կարգ: Ըստ կանոնի, առաջին թիվը մեծ է, քանի որ նրա կարգերն ավելի շատ են:բ.
        Համեմատենք 428 և 528 թվերը:Երկու թվերն էլ ունեն երեքական կարգ, ուրեմն՝
        պետք է համեմատել ամենամեծ կարգի թվերը: Քանի որ 4-ը փոքր է 5-ից, ապա
        առաջին թիվը փոքր է երկրորդ թվից: գ. Համեմատենք 9563 և 9566 թվերը:Երկու
        թվերն էլ ունեն չորսական կարգ, ուրեմն՝ պետք է համեմատել ամենամեծ կարգի
        թվերը: Տեսնում ենք, որ երկու թվերում էլ դա 9-ն է: Համընկնում են նաև
        հաջորդ երկու կարգերի թվերը: Քանի որ վերջին կարգում առաջին թվում 3 է, իսկ
        երկրորդում 6, ապա երկրորդ թիվն ավելի մեծ է: Մենք բոլորս կարողանում ենք
        հաշվել առարկաների քանակը: Հաշվելիս մենք թվերին քայլ առ քայլ մեկ ենք
        գումարում՝ արդյունքում ստանում ենք՝ 1,2,3,4,5,6,7,8,9,10,11,12,...
        թվերից որևէ մեկը:Հաշվելիս առաջացած 1,2,3,4,5,6,7,8,9,10,11,12... թվերը
        կոչվում են բնական թվեր, (0-ն բնական թիվ չէ):Ցանկացած երկու բնական թվեր
        կարելի է համեմատել, այսինքն՝ պարզել, թե որ թիվն է մեծ:Թվերի համեմատման
        ժամանակ օգտագործվում են հատուկ նշաններ՝ համեմատման նշաններ: «Մեծ» բառը
        փոխարինվում է{'>'}նշանով, իսկ «փոքր» բառը՝{'<'} նշանով: Թվերի համեմատման
        նշան է նաև քեզ ծանոթ հավասարության՝ =, նշանը:Երկու բնական թվերից մեծ է
        այն թիվը, որը հաշվելիս ավելի ուշ է հանդիպում: Եթե թվերը մեծ չեն, մենք
        ուղղակի հիշում ենք նրանց հաջորդականությունը:Օրինակ Ակնհայտ է, որ ութը
        մեծ է երեքից՝ 8 {'>'} 3, կամ որ 73 {'<'} 120 Մեծ թվերի համար
        օգտագործվում է հետևյալ կանոնը. 1) Եթե երկու բնական թվերի գրառումներում
        տարբեր քանակներով կարգեր (թվանշաններ) կան, ապա ավելի մեծ է այն թիվը, որի
        կարգերի քանակն ավելի մեծ է:2) Եթե թվերի թվանշանների քանակները նույնն են,
        ապա ավելի մեծ է այն թիվը, որի ամենամեծ կարգում գրված թիվն ավելի մեծ
        է:Եթե այդ կարգի թվերը հավասար են, ապա համեմատվում են հաջորդ կարգերը և
        այդպես շարունակ՝ մինչև միավորի կարգը:Օրինակա. Համեմատենք 75428 և 937
        թվերը:Առաջին թվի գրառման մեջ կա 5 կարգ, իսկ երկրորդի գրառման մեջ՝ 3
        կարգ: Ըստ կանոնի, առաջին թիվը մեծ է, քանի որ նրա կարգերն ավելի շատ են:բ.
        Համեմատենք 428 և 528 թվերը:Երկու թվերն էլ ունեն երեքական կարգ, ուրեմն՝
        պետք է համեմատել ամենամեծ կարգի թվերը: Քանի որ 4-ը փոքր է 5-ից, ապա
        առաջին թիվը փոքր է երկրորդ թվից: գ. Համեմատենք 9563 և 9566 թվերը:Երկու
        թվերն էլ ունեն չորսական կարգ, ուրեմն՝ պետք է համեմատել ամենամեծ կարգի
        թվերը: Տեսնում ենք, որ երկու թվերում էլ դա 9-ն է: Համընկնում են նաև
        հաջորդ երկու կարգերի թվերը: Քանի որ վերջին կարգում առաջին թվում 3 է, իսկ
        երկրորդում 6, ապա երկրորդ թիվն ավելի մեծ է:
      </p>
    </div>
  );
};

export default class1Div1Math;
