import React from 'react';

const class2Div1Math = () => {
  return (
    <div>
      <h2> Դաս 2. Կարգ, կարգային արժեք</h2>
      <p>
        Դու արդեն գիտես, թե թվի գրառության մեջ ինչ է ցույց տալիս յուրաքանչյուր
        կարգում գրված թվանշանը:Օրինակ 254647 թվի գրառման մեջ 4 թիվը գրված է
        երկրորդ և չորրորդ կարգերում: Տասնյակների (երկրորդ) կարգում գրված 4-ը
        ցույց է տալիս, որ տասնյակների կարգում կա չորս տասնյակ, Հազարյակների
        (չորրորդ) կարգում գրված 4-ը ցույց է տալիս, որ հազարյակների կարգում կա
        չորս հազարյակ:
      </p>
    </div>
  );
};

export default class2Div1Math;
